tutorials/plate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    ( 0		0	0)
    ( 5		0	0)
    ( 5		1	0)
    ( 0		1	0)
    ( 0		0	1)
    ( 5		0	1)
    ( 5		1	1)
    ( 0		1	1)
);

edges
(
);

blocks
(
    hex (0 1 2 3 4 5 6 7) iceZone (20 20 1) simpleGrading (1 20 1)
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }

    top
    {
        //type patch;
        type empty;
        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    in
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    out
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
);

mergePatchPairs
(
);

